# Завдання - Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
# [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”

def sum_numbers(s: str) -> int | str:
    try:
        numbers = s.split(',')  # Розбиваю рядок на частини по комі
        total = 0

        for num in numbers:
            total += int(num)
        return total

    except:
        return "Не можу це зробити!"  # Якщо буде помилка — повертаю повідомлення

# Створив список рядків, де деякі містять лише числа, а деякі — ще й текст
array = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]

# Пройшовся по кожному елементу масиву і викликав функцію
for item in array:
    result = sum_numbers(item)
    print(result)  # Вивожу результат (або суму, або повідомлення про помилку)
